In [350]:
phrase = "watch out!" # string
print(phrase)

watch out!

In [351]:
X = 5 # integer
Y = 10 # integer
Z = X + Y # plus

Z = Y / X # divide

J = type(Z)
print (J)

<class 'float'>

In [352]:
V1 = 7 # integer
V2 = 4 # integer
V3 = V1*V2
print(V3)

28

In [353]:
R = 2 # integer
Pi = 3.14
A = Pi * (R**2) # squaring
print(A)

12.56

In [354]:
name = "Michael"
hobby = "sleep"
long_string = name +" "+ hobby + " " + str(V3)
print (long_string)

Michael sleep 28

In [355]:
JT = "Regional Manager"
Phrase = f"my name is {name} and my job is {JT}"
print (Phrase)

my name is Michael and my job is Regional Manager

In [356]:
print(len(Phrase))

string_slice = Phrase[3:18]
print(string_slice)

filename = 'here_is_a_file.csv'
filename = filename[:-4]
print(filename)

49
name is Michael
here_is_a_file

In [357]:
slice_this_phrase = 'dog cat racoon'
print(slice_this_phrase[:3])
print(slice_this_phrase[4:7])
print(slice_this_phrase[-6:])

dog
cat
racoon

In [358]:
list_1 = [1,2,V1,X,V2,Y,V3]
print(type(list_1))
print(list_1)

<class 'list'>
[1, 2, 7, 5, 4, 10, 28]

In [359]:
favourite_colour = "red"
colours_list = ["black","blue","salmon",favourite_colour]
colours_list.append(favourite_colour)

print (f"My colours are :{colours_list}")

My colours are :['black', 'blue', 'salmon', 'red', 'red']

In [360]:
foodlist = ["hotdogs","rustlers","aspic","reformed ham","cold omelette"]

foodlist.append ("eggs")

print(foodlist)

['hotdogs', 'rustlers', 'aspic', 'reformed ham', 'cold omelette', 'eggs']

In [361]:
morefood = ["fish bones","hair"]
foodlist.extend(morefood)
foodlist.remove("rustlers")

print (foodlist)

['hotdogs', 'aspic', 'reformed ham', 'cold omelette', 'eggs', 'fish bones', 'hair']

In [362]:
numbers_list = [1,28,14,7,4,2]
numbers_list.sort()
print(numbers_list)
numbers_list.sort(reverse=True)
print(numbers_list)

sorted_numbers = sorted(numbers_list)
print(sorted_numbers)

foodlist_sorted = sorted(foodlist)
print(foodlist)
print(foodlist_sorted)

foodlist_reversesorted = sorted(foodlist, reverse=True)
print(foodlist_reversesorted)
foodlist_sorted.reverse()
print(foodlist_sorted)

[1, 2, 4, 7, 14, 28]
[28, 14, 7, 4, 2, 1]
[1, 2, 4, 7, 14, 28]
['hotdogs', 'aspic', 'reformed ham', 'cold omelette', 'eggs', 'fish bones', 'hair']
['aspic', 'cold omelette', 'eggs', 'fish bones', 'hair', 'hotdogs', 'reformed ham']
['reformed ham', 'hotdogs', 'hair', 'fish bones', 'eggs', 'cold omelette', 'aspic']
['reformed ham', 'hotdogs', 'hair', 'fish bones', 'eggs', 'cold omelette', 'aspic']

In [363]:
restaurants_dict = {"Dirties":"Mexican",
                          "Subway":["Sandwiches","Cookies"],
                          "McDonalds":"Burgers",
                          "Wetherspoons":{"Monday":"Cheap drinks",
                                    "Thursday":"Curry Club"}}

print(restaurants_dict)
print(restaurants_dict["Wetherspoons"])
print(restaurants_dict.keys())
print(restaurants_dict.values())
print(restaurants_dict.items())

{'Dirties': 'Mexican', 'Subway': ['Sandwiches', 'Cookies'], 'McDonalds': 'Burgers', 'Wetherspoons': {'Monday': 'Cheap drinks', 'Thursday': 'Curry Club'}}
{'Monday': 'Cheap drinks', 'Thursday': 'Curry Club'}
dict_keys(['Dirties', 'Subway', 'McDonalds', 'Wetherspoons'])
dict_values(['Mexican', ['Sandwiches', 'Cookies'], 'Burgers', {'Monday': 'Cheap drinks', 'Thursday': 'Curry Club'}])
dict_items([('Dirties', 'Mexican'), ('Subway', ['Sandwiches', 'Cookies']), ('McDonalds', 'Burgers'), ('Wetherspoons', {'Monday': 'Cheap drinks', 'Thursday': 'Curry Club'})])

In [364]:
restaurants_dict2 = {"Dirties":"Mexican",
                          "Subway":["Sandwiches","Cookies"],
                          "McDonalds":"Burgers",
                          "Yo!Sushi":"Sushi",
                          "Wetherspoons":{"Monday":"Cheap drinks",
                                    "Thursday":"Curry Club"}}

restaurants_dict2["KFC"] = "Chicken"
restaurants_dict2["Subway"] = "Subs"
print(restaurants_dict2)

print("Burger King" in restaurants_dict2.values())
print("Curry Club" in restaurants_dict2)
print("Curry Club" in restaurants_dict2.values())

{'Dirties': 'Mexican', 'Subway': 'Subs', 'McDonalds': 'Burgers', 'Yo!Sushi': 'Sushi', 'Wetherspoons': {'Monday': 'Cheap drinks', 'Thursday': 'Curry Club'}, 'KFC': 'Chicken'}
False
False
False

In [365]:
Group_0_dict = {"Michael": "Regional Manager",
                "Nazahah": "Performance Analyst"}

x = list(Group_0_dict.keys())

print("test")

#print(Group_0_dict)

#for x in Group_0_dict:
 #print(x)
#for x, y in Group_0_dict.items():
  #print(x, y)


#print = f"my name is {x} and my job is {y}"

test

In [366]:
job_dict= {'test':'test2'}

print(job_dict)

{'test': 'test2'}

In [367]:
#HOMEWORK
homework_dict = {}

x = 7
y = 5

eckspluswhy = x+y
eckstimeswhy = x*y
eckssquared = x**2
whysquared = y**2
eckstothepowerwhy = x**y

homework_dict["x + y"] = eckspluswhy
homework_dict["x * y"] = eckstimeswhy
homework_dict["x^2"] = eckssquared,
homework_dict["y^2"] = whysquared,
homework_dict["x^y"]= eckstothepowerwhy

for homeworklist in homework_dict.items():
  print(homeworklist)

('x + y', 12)
('x * y', 35)
('x^2', (49,))
('y^2', (25,))
('x^y', 16807)

In [368]:
#HOMEWORK2

cc = "4444444444444444"
cclast4 = cc[-4:]
ccfirst12 = cc[:-4]
ccfirst12redacted = ccfirst12.replace("4","X")
ccredacted = ccfirst12redacted + cclast4

print(ccredacted)

XXXXXXXXXXXX4444

In [369]:
import pandas as pd

dict_1 = {"Here's a column":["val 1","val 2","val 3"],
          "col 2":[4,5,6],
          "col z":["foo","bar","baz"]}

df_1 = pd.DataFrame(dict_1)
df_1

  Here's a column  col 2 col z
0           val 1      4   foo
1           val 2      5   bar
2           val 3      6   baz

In [370]:
list_of_dicts = [{"letter":"a",
                  "word":"foo",
                  "number":1},
                  {"letter":"b",
                  "word":"bar",
                  "number":2},
                  {"letter":"c",
                  "word":"baz",
                  "number":3}]
df_2 = pd.DataFrame(list_of_dicts)
df_2

  letter word  number
0      a  foo       1
1      b  bar       2
2      c  baz       3

In [371]:
import pandas as pd
list_of_employees = [{"Name":"Jack Smith",
                  "Salary":1000,
                  "JobTitle":"CEO"},
                  {"Name":"Brad Peters",
                  "Salary":700,
                  "JobTitle":"CFO"},
                  {"Name":"Emma Rogers",
                  "Salary":600,
                  "JobTitle":"CTO"},
                  {"Name":"Luke Martin",
                  "Salary":500,
                  "JobTitle":"COO"},
                   {"Name":"Sophie Freeman",
                  "Salary":800,
                  "JobTitle":"CMO"}]
df_2 = pd.DataFrame(list_of_employees)
print(df_2)

             Name  Salary JobTitle
0      Jack Smith    1000      CEO
1     Brad Peters     700      CFO
2     Emma Rogers     600      CTO
3     Luke Martin     500      COO
4  Sophie Freeman     800      CMO

In [372]:
#print(df_2.info()) # prints info about all fields
print(df_2.dtypes) # Prints data types
print(df_2.head(1)) # prints up to 50 of the first rows
print(df_2.tail(2)) # prints the last rows

Name        object
Salary       int64
JobTitle    object
dtype: object
         Name  Salary JobTitle
0  Jack Smith    1000      CEO
             Name  Salary JobTitle
3     Luke Martin     500      COO
4  Sophie Freeman     800      CMO

In [373]:
df_2["Salary"] = df_2["Salary"].astype("int")
df_2.dtypes

Name        object
Salary       int64
JobTitle    object
dtype: object

In [374]:
salary_tot = (df_2["Salary"].sum())
salary_mean = (df_2["Salary"].mean())
print(salary_mean)
sal_min_max = f"Salary minimum:{df_2['Salary'].min()},Salary maximum:{df_2['Salary'].max()}"
print(sal_min_max)

720.0
Salary minimum:500,Salary maximum:1000

In [375]:
df_2["DateStarted"] = ["01/12/2022","02/11/2022","03/10/2022","04/09/2023","05/08/2023"]
df_2

             Name  Salary JobTitle DateStarted
0      Jack Smith    1000      CEO  01/12/2022
1     Brad Peters     700      CFO  02/11/2022
2     Emma Rogers     600      CTO  03/10/2022
3     Luke Martin     500      COO  04/09/2023
4  Sophie Freeman     800      CMO  05/08/2023

In [376]:
inflation = 0.067
df_2["SalaryNew"] = df_2["Salary"]*inflation+df_2["Salary"]
bonus = 100
df_2["PayAfterBonus"] = df_2["SalaryNew"]+bonus

df_2

             Name  Salary JobTitle DateStarted  SalaryNew  PayAfterBonus
0      Jack Smith    1000      CEO  01/12/2022     1067.0         1167.0
1     Brad Peters     700      CFO  02/11/2022      746.9          846.9
2     Emma Rogers     600      CTO  03/10/2022      640.2          740.2
3     Luke Martin     500      COO  04/09/2023      533.5          633.5
4  Sophie Freeman     800      CMO  05/08/2023      853.6          953.6

In [377]:
#df_2["DateStarted"] = pd.to_datetime(df_2["DateStarted"],dayfirst=True)
df_2["DateStarted"] = pd.to_datetime(df_2["DateStarted"],format="%d/%m/%Y")
df_2

             Name  Salary JobTitle DateStarted  SalaryNew  PayAfterBonus
0      Jack Smith    1000      CEO  2022-12-01     1067.0         1167.0
1     Brad Peters     700      CFO  2022-11-02      746.9          846.9
2     Emma Rogers     600      CTO  2022-10-03      640.2          740.2
3     Luke Martin     500      COO  2023-09-04      533.5          633.5
4  Sophie Freeman     800      CMO  2023-08-05      853.6          953.6

In [382]:
df_2["DOB"] = ["01/12/2000","02/11/2001","03/10/2002","04/09/2003","05/08/2004"]
df_2["DOB"] = pd.to_datetime(df_2["DOB"],dayfirst=True)
df_2["TimeServed"] = pd.to_datetime('06/11/23',format='%d/%m/%y')-df_2["DateStarted"] # lower case "y" when not using the first two digits of the year
df_2["TimeServed2"] = df_2["TimeServed"]/pd.Timedelta('365 days')
df_2["TimeServed2"] = df_2["TimeServed2"].round().astype('int',errors='ignore')

df_2.dtypes
df_2

,Name,Salary,JobTitle,DateStarted,SalaryNew,PayAfterBonus,DOB,TimeServed,TimeServed2
0,Jack Smith,1000,CEO,2022-12-01,1067.0,1167.0,2000-12-01,340 days,1
1,Brad Peters,700,CFO,2022-11-02,746.9,846.9,2001-11-02,369 days,1
2,Emma Rogers,600,CTO,2022-10-03,640.2,740.2,2002-10-03,399 days,1
3,Luke Martin,500,COO,2023-09-04,533.5,633.5,2003-09-04,63 days,0
4,Sophie Freeman,800,CMO,2023-08-05,853.6,953.6,2004-08-05,93 days,0